src/cf/Catalogs/УдалитьCRM_ПапкиЭлектронныхПисем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>УдалитьCRM_ПапкиЭлектронныхПисем</Name>
			<Comment>Не переносить в объединенные решения</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.УчетныеЗаписиЭлектроннойПочты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_ВидыПапокЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Comment>Порядок</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПапкаMSExchange</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_СтруктурыПапокMSExchange</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредопределеннаяПапка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>скFolderID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>скDistinguishedID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>скСостояниеСинхронизацииMSExchange</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/CRM_СтруктурыПапокMSExchange.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>CRM_СтруктурыПапокMSExchange</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СерверMSExchange</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_СерверыMSExchange</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_УчетныеЗаписиПользователейMSExchange</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнейЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ParentFolderId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DisplayName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FolderClass</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ChildFolderCount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DistinguishedFolderId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПапкиЭлектроннойПочты1С</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_ВидыПапокЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/УдалитьCRM_ПапкиЭлектронныхПисем/Forms/ФормаСписка/Ext/Form/Module.bsl
///////////////////////////////////////////////////////////////////////////////
// ОБЩИЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Функция ДобавитьПапкиMSExchangeНаСервере(УчетнаяЗаписьMSExchange)
	Если Не ЗначениеЗаполнено(УчетнаяЗаписьMSExchange) Тогда
		Возврат НСтр("ru = 'Не указана учетная запись MS Exchange!'");
	КонецЕсли;
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ ПЕРВЫЕ 1 РАЗРЕШЕННЫЕ
	|	СтруктурыПапокMSExchange.Ссылка
	|ИЗ
	|	Справочник.CRM_СтруктурыПапокMSExchange КАК СтруктурыПапокMSExchange
	|ГДЕ
	|	СтруктурыПапокMSExchange.СерверMSExchange = &СерверMSExchange
	|	И СтруктурыПапокMSExchange.УчетнаяЗапись = &УчетнаяЗапись
	|");
	Запрос.УстановитьПараметр("СерверMSExchange", УчетнаяЗаписьMSExchange.СерверMSExchange);
	Запрос.УстановитьПараметр("УчетнаяЗапись", УчетнаяЗаписьMSExchange);
	Если Запрос.Выполнить().Пустой() Тогда
		Возврат НСтр("ru = 'Для учетной записи электронной почты '") + """" + Строка(Владелец) + """ "
			+ Символы.ПС + НСтр("ru = 'структура папок MS Exchange еще не была загружена с сервера!'");
		//
	КонецЕсли;
	
	Справочники.CRM_СтруктурыПапокMSExchange.ДобавитьПапкиMSExchangeВСправочникПапкиЭлектронныхПисем(Владелец, УчетнаяЗаписьMSExchange, УчетнаяЗаписьMSExchange.СерверMSExchange);
	
	Возврат Неопределено;
КонецФункции

/////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ДобавитьПапкиMSExchange(Команда)
	Если Не ЗначениеЗаполнено(Владелец) Тогда
		Возврат;
	КонецЕсли;
	
	УчетнаяЗаписьMSExchange = CRM_MSExchangeВызовСервера.ПолучитьУчетнуюЗаписьMSExchangeПоУчетнойЗаписиЭлектроннойПочты(Владелец);
	Если Не ЗначениеЗаполнено(УчетнаяЗаписьMSExchange) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Для учетной записи электронной почты '") + """" + Строка(Владелец) + """" + Символы.ПС
			+ НСтр("ru = 'не найдена соответствующая учетная запись MS Exchange!'"));
		//
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьПапкиMSExchangeЗавершение", ЭтотОбъект, УчетнаяЗаписьMSExchange);
	ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Текущая структура папок будет дополнена папками из MS Exchange.
													|Продолжить?'"), РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПапкиMSExchangeЗавершение(Ответ, УчетнаяЗаписьMSExchange) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда
		СтрОшибка = ДобавитьПапкиMSExchangeНаСервере(УчетнаяЗаписьMSExchange);
		Если ТипЗнч(СтрОшибка) = Тип("Строка") И ЗначениеЗаполнено(СтрОшибка)  Тогда
			ПоказатьПредупреждение(, СтрОшибка);
		КонецЕсли;
		Элементы.Список.Обновить();
	КонецЕсли;
КонецПроцедуры

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ПолучитьФункциональнуюОпцию("CRM_ИспользоватьОбменСMSExchange") Тогда
		УчетнаяЗаписьMSExchange = Неопределено;
		Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("Владелец") Тогда
			Владелец = Параметры.Отбор.Владелец;
			УчетнаяЗаписьMSExchange = CRM_MSExchangeВызовСервера.ПолучитьУчетнуюЗаписьMSExchangeПоУчетнойЗаписиЭлектроннойПочты(Владелец);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Владелец) Или Не ЗначениеЗаполнено(УчетнаяЗаписьMSExchange) Или Не ПравоДоступа("Добавление", Метаданные.Справочники.ПапкиЭлектронныхПисем) Тогда
			Элементы.СписокДобавитьПапкиMSExchange.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
